# RemoveDisplacedElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..RemoveDisplacedElement Method
DisplacementElement Class See Also
---
Remove a displaced element from this DisplacementElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RemoveDisplacedElement(
	Element ElemToRemove
)
```

Visual Basic
---
```text
Public Sub RemoveDisplacedElement ( _
	ElemToRemove As Element _
)
```

Visual C++
---
```text
public:
void RemoveDisplacedElement(
	Element^ ElemToRemove
)
```

# ### Parameters
ElemToRemove
    Type: Autodesk.Revit.DB..::..Element The element to remove.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace